{
  "translations": {
    "common.myProfile": "My profile",
    "common.logOut": "Log Out",
    "common.logIn": "Log In",
    "common.signUp": "Sign Up",
    "common.view": "view",
    "common.ratingsPrevious": "Your previous vote is:",
    "common.mins": "mins",
    "common.buyTicket": "Buy ticket"
  },
  "login/signupPage": {
    "firstName": "First Name",
    "lastName": "Last Name",
    "mailAdress": "Email Address",
    "password": "Password",
    "or": "or",
    "googleBtn.logIn": "Log In with Google",
    "googleBtn.signup": "Join with Google",
    "dontHaveAccount.login": "Don't have an account? Sign Up",
    "dontHaveAccount.signup": "Already have an account? Log In",
    "validationError.login": "Current Email or Password is invalid",
    "validationError.signup": "Current Email is already exist"
  },
  "movieCommon": {
    "genres.Action": "Action",
    "genres.Adventure": "Adventure",
    "genres.Animation": "Animation",
    "genres.Biography": "Biography",
    "genres.Crime": "Crime",
    "genres.Drama": "Drama",
    "genres.Family": "Family",
    "genres.Fantasy": "Fantasy",
    "genres.Japanese": "Japanese",
    "genres.Romance": "Romance",
    "genres.Sci-Fi": "Sci-Fi",
    "genres.Science Fiction": "Science Fiction",
    "genres.Thriller": "Thriller",
    "description.aboutMovie": "About the movie",
    "description.releaseDate": "Release Date",
    "description.runtime": "Runtime",
    "description.budget": "Budget",
    "description.revenue": "Revenue"
  },
  "movieContent": {
    "title.Solo: A Star Wars Story": "Solo: A Star Wars Story",
    "title.Guardians of the Galaxy Vol. 3": "Guardians of the Galaxy Vol. 3",
    "title.Star Wars: Episode IX - The Rise of Skywalker": "Star Wars: Episode IX - The Rise of Skywalker",
    "title.The Irishman": "The Irishman",
    "title.Avengers: Infinity War": "Avengers: Infinity War",
    "title.Shazam!": "Shazam!",
    "title.Gemini Man": "Gemini Man",
    "title.Aquaman": "Aquaman",
    "title.Your Name": "Your Name",
    "title.A Silent Voice: The Movie": "A Silent Voice: The Movie",
    "tagline.Solo: A Star Wars Story": "Never tell him the odds.",
    "tagline.Guardians of the Galaxy Vol. 3": "",
    "tagline.Star Wars: Episode IX - The Rise of Skywalker": "The Saga Concludes.",
    "tagline.The Irishman": "His story changed history.",
    "tagline.Avengers: Infinity War": "Destiny arrives.",
    "tagline.Shazam!": "If you want to save the world, say the magic word.",
    "tagline.Gemini Man": "Meet your match.",
    "tagline.Aquaman": "Home is calling.",
    "tagline.Your Name": "Experience the best Japanese movie of 2016 by Makoto Shinkai",
    "tagline.A Silent Voice: The Movie": "Sometimes the answer is as simple as learning to listen...",
    "overview.Solo: A Star Wars Story": "With the emerging demand of hyperfuel and other resources, Han Solo finds himself in the middle of a heist alongside other criminals, where they meet the likes of Chewbacca and Lando Calrissian in an adventurous situation exposing the criminal underworld.",
    "overview.Guardians of the Galaxy Vol. 3": "",
    "overview.Star Wars: Episode IX - The Rise of Skywalker": "The surviving Resistance faces the First Order once more in the final chapter of the Skywalker saga.",
    "overview.The Irishman": "Frank 'The Irishman' Sheeran is a man with a lot on his mind. The former labor union high official and hitman, learned to kill serving in Italy during the Second World War. He now looks back on his life and the hits that defined his mob career, maintaining connections with the Bufalino crime family. In particular, the part he claims to have played in the disappearance of his life-long friend, Jimmy Hoffa, the former president of the International Brotherhood of Teamsters, who mysteriously vanished in late July 1975 at the age of 62.",
    "overview.Avengers: Infinity War": "As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment, the fate of Earth and existence has never been more uncertain.",
    "overview.Shazam!": "In Philadelphia, Billy Batson is an abandoned child who is proving a nuisance to Child Services and the authorities with his stubborn search for his lost mother. However, in his latest foster home, Billy makes a new friend, Freddy, and finds himself selected by the Wizard Shazam to be his new champion. Now endowed with the ability to instantly become an adult superhero by speaking the wizard's name, Billy gleefully explores his new powers with Freddy. However, Billy soon learns that he has a deadly enemy, Dr. Thaddeus Sivana, who was previously rejected by the wizard and has accepted the power of the Seven Deadly Sins instead. Now pursued by this mad scientist for his own power as well, Billy must face up to the responsibilities of his calling while learning the power of a special magic with his true family that Sivana can never understand.",
    "overview.Gemini Man": "A retiring assassin, Henry Brogan, finds himself pursued by a mysterious killer that can predict his every move. Discovering that he's being hunted by a younger clone of himself, Henry needs to find out why he's being targeted and who the creator is.",
    "overview.Aquaman": "Arthur Curry, half human half from Atlantis, goes on a trip of a lifetime. Not only does this adventure compel him to come to terms with his real identity, but it also forces him to discover whether he is entirely worthy of fulfilling his own destiny: becoming a king.",
    "overview.Your Name": "Mitsuha is the daughter of the mayor of a small mountain town. She's a straightforward high school girl who lives with her sister and her grandmother and has no qualms about letting it be known that she's uninterested in Shinto rituals or helping her father's electoral campaign. Instead she dreams of leaving the boring town and trying her luck in Tokyo. Taki is a high school boy in Tokyo who works part-time in an Italian restaurant and aspires to become an architect or an artist. Every night he has a strange dream where he becomes...a high school girl in a small mountain town.",
    "overview.A Silent Voice: The Movie": "The story revolves around Shôko Nishimiya, a grade school student who has impaired hearing. She transfers into a new school, where she is bullied by her classmates, especially Shôya Ishida. It gets to the point where she transfers to another school and as a result, Shôya is ostracized and bullied himself, with no friends to speak to and no plans for the future. Years later, he sets himself on a path to redemption."
  },
  "comments": {
    "authSign": "Log in or sign up to leave a comment",
    "typeComment": "Type your comment",
    "postComment": "post comment"
  },
  "movieSorting": {
    "rating": "Rating",
    "date": "Date"
  }
}
